#### SpatialElementGeometryResults Members

---

|  |
| --- |
| SpatialElementGeometryResults Class   Methods   Properties   See Also |

The  SpatialElementGeometryResults  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  SpatialElementGeometryResults |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetBoundaryFaceInfo | Query the spatial element boundary face information with the given face. |
| Public method | GetGeometry | The solid from the spatial element. |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

SpatialElementGeometryResults Class

Autodesk.Revit.DB Namespace